Repository: yangmt0409/StudySync
Catalog: StudySync/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, ko, zh_hant

source: 输入地点...
en: Enter location...
ja: 場所を入力...
ko: 위치 입력...
zh_hant: 輸入地點...

source: 输入好友的好友码
en: Enter friend's code
ja: フレンドコードを入力
ko: 친구 코드 입력
zh_hant: 輸入好友的好友碼

source: 输入待办内容...
en: What needs to be done...
ja: 何をしますか...
ko: 할 일 입력...
zh_hant: 輸入待辦內容...

source: 输入航班号自动补全
en: Auto-fill from flight number
ja: 航空便番号で自動入力
ko: 항공편 번호로 자동 채우기
zh_hant: 輸入航班號自動補全

source: 输入课程名
en: Enter course name
ja: 科目名を入力
ko: 과목 이름 입력
zh_hant: 輸入課程名

source: 输入项目码
en: Enter project code
ja: プロジェクトコードを入力
ko: 프로젝트 코드 입력
zh_hant: 輸入項目碼

source: 达成里程碑！
en: Milestone Reached!
ja: マイルストーン達成!
ko: 마일스톤 달성!
zh_hant: 達成里程碑！

source: 过安检
en: Go through security
ja: 保安検査
ko: 보안검색
zh_hant: 過安檢

source: 运营方
en: Operator
ja: 運行会社
ko: 운영사
zh_hant: 營運方

source: 返回数据不完整，请尝试手动输入
en: Incomplete data — try manual entry
ja: データが不完全です、手動入力をお試しください
ko: 데이터가 불완전해요, 수동 입력을 시도하세요
zh_hant: 返回資料不完整,請嘗試手動輸入

source: 返回格式异常
en: Invalid response format
ja: 応答形式エラー
ko: 응답 형식 오류
zh_hant: 返回格式異常

source: 还剩 %lld 天
en: %lld days left
ja: 残り%lld日
ko: %lld일 남음
zh_hant: 還剩 %lld 天

source: 还差 %@ 小时
en: %@ hours to go
ja: あと%@時間
ko: %@시간 남음
zh_hant: 還差 %@ 小時

source: 还有 %lld 分钟
en: %lld min left
ja: 残り%lld分
ko: %lld분 남음
zh_hant: 還有 %lld 分鐘

source: 还有 %lld 天 %lld 小时
en: %1$lldd %2$lldh left
ja: あと%1$lld日%2$lld時間
ko: %1$lld일 %2$lld시간 남음
zh_hant: 還有 %1$lld 天 %2$lld 小時

source: 还有 %lld 小时
en: %lld hours left
ja: 残り%lld時間
ko: %lld시간 남음
zh_hant: 還有 %lld 小時

source: 还有 %lld 小时 %lld 分钟
en: %lld hr %lld min left
ja: 残り%lld時間%lld分
ko: %lld시간 %lld분 남음
zh_hant: 還有 %lld 小時 %lld 分鐘

source: 还有 %lld 条已完成的待办未显示
en: %lld more completed todos not shown
ja: 他に%lld件の完了ToDoがあります
ko: 완료된 할 일 %lld개가 더 있어요
zh_hant: 還有 %lld 條已完成的待辦未顯示

source: 还有%lld天
en: %lld days left
ja: 残り%lld日
ko: %lld일 남음
zh_hant: 還有%lld天

source: 还没有 AI 账户
en: No AI Accounts
ja: AIアカウントがありません
ko: AI 계정 없음
zh_hant: 還沒有 AI 帳戶

source: 还没有专注记录
en: No focus sessions yet
ja: まだフォーカスセッションがありません
ko: 아직 집중 기록이 없어요
zh_hant: 還沒有專注記錄

source: 还没有任务
en: No Tasks Yet
ja: タスクがまだありません
ko: 아직 태스크가 없어요
zh_hant: 還沒有任務

source: 还没有倒计时事件
en: No countdown events yet
ja: カウントダウンイベントがまだありません
ko: 아직 카운트다운 이벤트가 없어요
zh_hant: 還沒有倒數事件

source: 还没有好友
en: No Friends Yet
ja: 友達がまだいません
ko: 아직 친구가 없어요
zh_hant: 還沒有好友

source: 还没有学习目标
en: No Study Goals Yet
ja: 学習目標がまだありません
ko: 아직 학습 목표가 없어요
zh_hant: 還沒有學習目標

source: 还没有待办事项
en: No Todos Yet
ja: ToDoがまだありません
ko: 아직 할 일이 없어요
zh_hant: 還沒有待辦事項

source: 还没有打卡记录
en: No check-ins yet
ja: チェックインがまだありません
ko: 아직 체크인 기록이 없어요
zh_hant: 還沒有打卡記錄

source: 还没有获得徽章
en: No badges earned yet
ja: バッジはまだ獲得していません
ko: 아직 획득한 배지가 없어요
zh_hant: 還沒有獲得徽章

source: 还没有解锁装饰品
en: No decorations unlocked yet
ja: まだ装飾をアンロックしていません
ko: 아직 장식품을 잠금 해제하지 않았어요
zh_hant: 還沒有解鎖裝飾品

source: 还没有课程
en: No Courses Yet
ja: 科目がまだありません
ko: 아직 과목이 없어요
zh_hant: 還沒有課程

source: 还没有账号？注册
en: No account? Sign up
ja: アカウントをお持ちでないですか?新規登録
ko: 계정이 없으신가요? 가입
zh_hant: 還沒有帳號？註冊

source: 还没有项目
en: No Projects Yet
ja: プロジェクトがまだありません
ko: 아직 프로젝트가 없어요
zh_hant: 還沒有項目

source: 这些标签会显示在「更多」页面中。点击 + 移回标签栏。
en: These tabs appear in the "More" page. Tap + to move back to the tab bar.
ja: これらのタブは「その他」ページに表示されます。+をタップしてタブバーに戻します。
ko: 이 탭들은 '더보기' 페이지에 표시돼요. +를 눌러 탭바로 되돌리세요.
zh_hant: 這些標籤會顯示在「更多」頁面中。點擊 + 移回標籤列。

source: 这是一个重复事件，你想如何删除？
en: This is a recurring event. How would you like to delete it?
ja: これは繰り返しイベントです。どのように削除しますか?
ko: 반복 이벤트예요. 어떻게 삭제할까요?
zh_hant: 這是一個重複事件，你想如何刪除？

source: 这是别人看到的你的时间轴
en: This is how others see your timeline
ja: これが他の人に見えるあなたのタイムラインです
ko: 다른 사람이 보는 내 타임라인이에요
zh_hant: 這是別人看到的你的時間軸

source: 进度
en: Progress
ja: 進捗
ko: 진행률
zh_hant: 進度

source: 进度条
en: Bar
ja: バー
ko: 바
zh_hant: 進度條

source: 进度环
en: Ring
ja: リング
ko: 링
zh_hant: 進度環

source: 进站检票
en: Ticket gate
ja: 改札
ko: 개찰구
zh_hant: 進站檢票

source: 进行中
en: In Progress
ja: 進行中
ko: 진행 중
zh_hant: 進行中

source: 连接你的日历
en: Connect Your Calendar
ja: カレンダーを接続
ko: 캘린더 연결
zh_hant: 連接你的日曆

source: 连续
en: Streak
ja: ストリーク
ko: 연속
zh_hant: 連續

source: 连续 %lld 次
en: Streak: %lld
ja: ストリーク: %lld
ko: 연속: %lld
zh_hant: 連續 %lld 次

source: 连续打卡
en: Streaks
ja: ストリーク
ko: 연속 체크인
zh_hant: 連續打卡

source: 连续打卡 7 天
en: 7-day check-in streak
ja: 7日連続チェックイン
ko: 7일 연속 체크인
zh_hant: 連續打卡 7 天

source: 连续打卡 30 天
en: 30-day check-in streak
ja: 30日連続チェックイン
ko: 30일 연속 체크인
zh_hant: 連續打卡 30 天

source: 连续打卡 100 天
en: 100-day check-in streak
ja: 100日連続チェックイン
ko: 100일 연속 체크인
zh_hant: 連續打卡 100 天

source: 退出登录
en: Sign Out
ja: サインアウト
ko: 로그아웃
zh_hant: 登出

source: 退出项目
en: Leave Project
ja: プロジェクトから退出
ko: 프로젝트 나가기
zh_hant: 退出項目

source: 选择
en: Select
ja: 選択
ko: 선택
zh_hant: 選擇

source: 选择 PDF 文件
en: Choose PDF file
ja: PDFファイルを選択
ko: PDF 파일 선택
zh_hant: 選擇 PDF 檔案

source: 选择「分享」或「分享 Pass」
en: Choose "Share" or "Share Pass"
ja: 「共有」または「Pass を共有」を選びます
ko: "공유" 또는 "Pass 공유"를 선택합니다
zh_hant: 選擇「分享」或「分享 Pass」

source: 选择你要关联的 AI 服务，登录后自动追踪用量。
en: Select an AI service to link. Usage will be tracked automatically after login.
ja: 連携するAIサービスを選択してください。サインイン後、使用量が自動追跡されます。
ko: 연결할 AI 서비스를 선택하세요. 로그인 후 사용량이 자동 추적돼요.
zh_hant: 選擇你要關聯的 AI 服務，登入後自動追蹤用量。

source: 选择最多 3 个徽章展示在个人资料上
en: Choose up to 3 badges to display on your profile
ja: プロフィールに表示するバッジを最大3つまで選択
ko: 프로필에 표시할 배지를 최대 3개까지 선택하세요
zh_hant: 選擇最多 3 個徽章展示在個人資料上

source: 选择最多 5 个装饰品展示在个人资料上
en: Choose up to 5 decorations to display on your profile
ja: プロフィールに表示する装飾を最大5つまで選択
ko: 프로필에 표시할 장식품을 최대 5개까지 선택하세요
zh_hant: 選擇最多 5 個裝飾品展示在個人資料上

source: 选择图片
en: Choose Photo
ja: 写真を選択
ko: 사진 선택
zh_hant: 選擇圖片

source: 选择家乡和留学城市，用于双时钟和时差显示
en: Set home and study cities for dual clock and time difference
ja: デュアルクロックと時差表示のための故郷と留学先の都市を選択
ko: 듀얼 시계와 시차 표시에 사용할 고향과 유학 도시 선택
zh_hant: 選擇家鄉和留學城市，用於雙時鐘和時差顯示

source: 选择模板后自动填入，只需修改标题和日期
en: Auto-fill from template, just edit title and dates
ja: テンプレートを選ぶと自動入力されます。タイトルと日付を編集するだけ
ko: 템플릿을 선택하면 자동으로 채워져요. 제목과 날짜만 수정하세요
zh_hant: 選擇模板後自動填入，只需修改標題和日期

source: 选择添加方式
en: Choose import method
ja: インポート方法を選択
ko: 가져오기 방법 선택
zh_hant: 選擇匯入方式

source: 选择要导出的数据类型
en: Choose data types to export
ja: エクスポートするデータの種類を選択
ko: 내보낼 데이터 유형 선택
zh_hant: 選擇要匯出的數據類型

source: 选择车站
en: Pick station
ja: 駅を選択
ko: 역 선택
zh_hant: 選擇車站

source: 选择颜色后点击或拖动来标记时间
en: Select a color, then tap or drag to mark time slots
ja: 色を選択してから、タップまたはドラッグして時間帯をマーク
ko: 색상을 선택한 후 탭하거나 드래그해서 시간대를 표시하세요
zh_hant: 選擇顏色後點擊或拖動來標記時間

source: 选项
en: Options
ja: オプション
ko: 옵션
zh_hant: 選項

source: 通知已开启
en: Notifications enabled
ja: 通知が有効になりました
ko: 알림 활성화됨
zh_hant: 通知已開啟

source: 通过 App Store 购买激活
en: Activated via App Store purchase
ja: App Storeでの購入により有効化
ko: App Store 구매로 활성화됨
zh_hant: 透過 App Store 購買啟用

source: 通过好友码添加朋友，互相查看学习进度
en: Add friends via code to track each other's progress
ja: フレンドコードで友達を追加して、お互いの学習進捗を確認
ko: 친구 코드로 친구를 추가하고 서로의 학습 진행을 확인하세요
zh_hant: 透過好友碼新增朋友，互相查看學習進度

source: 邀请伙伴加入项目，一起协作！
en: Invite teammates to join and collaborate!
ja: チームメンバーを招待して一緒に協力しましょう!
ko: 팀원을 초대해서 함께 협업해요!
zh_hant: 邀請夥伴加入項目，一起協作！

source: 邀请好友
en: Invite Friends
ja: 友達を招待
ko: 친구 초대
zh_hant: 邀請好友

source: 邮箱
en: Email
ja: メール
ko: 이메일
zh_hant: 郵箱

source: 配置 API Key
en: Configure API Key
ja: APIキーを設定
ko: API 키 설정
zh_hant: 設定 API Key

source: 配置我自己的 API Key
en: Configure my own API key
ja: 自分のAPIキーを設定
ko: 내 API 키 설정
zh_hant: 設定我自己的 API Key

source: 里程碑
en: Milestones
ja: マイルストーン
ko: 마일스톤

source: 重复
en: Repeat
ja: 繰り返し
ko: 반복
zh_hant: 重複

source: 重新激活
en: Reactivate
ja: 再アクティブ化
ko: 재활성화
zh_hant: 重新啟用

source: 重新登录
en: Re-login
ja: 再サインイン
ko: 다시 로그인
zh_hant: 重新登入

source: 重置密码
en: Reset Password
ja: パスワードをリセット
ko: 비밀번호 재설정
zh_hant: 重設密碼

source: 重置本周
en: Reset Week
ja: 今週をリセット
ko: 이번 주 초기화
zh_hant: 重置本週

source: 重置邮件已发送，请检查你的收件箱
en: Reset email sent. Please check your inbox.
ja: リセットメールを送信しました。受信トレイをご確認ください。
ko: 재설정 이메일을 보냈어요. 받은편지함을 확인해주세요.
zh_hant: 重設郵件已傳送，請檢查你的收件匣

source: 错误
en: Error
ja: エラー
ko: 오류
zh_hant: 錯誤

source: 长休息
en: Long Break
ja: 長い休憩
ko: 긴 휴식
zh_hant: 長休息

source: 长途大巴
en: Long-distance bus
ja: 長距離バス
ko: 고속버스
zh_hant: 長途大巴

source: 防止数据丢失
en: Protects against data loss
ja: データ損失を防止
ko: 데이터 손실 방지
zh_hant: 防止資料遺失

source: 隐私政策
en: Privacy Policy
ja: プライバシーポリシー
ko: 개인정보 처리방침
zh_hant: 隱私政策

source: 集合中
en: MEETUP
ko: 모임 중

source: 集合地点
en: Meetup Place
ja: 集合場所
ko: 모임 장소
zh_hant: 集合地點

source: 集合时间
en: Meetup Time
ja: 集合時間
ko: 모임 시간
zh_hant: 集合時間

source: 集合标题
en: Meetup Title
ja: 集合タイトル
ko: 모임 제목
zh_hant: 集合標題

source: 需要日历写入权限
en: Calendar Write Access Needed
ja: カレンダーへの書き込み権限が必要です
ko: 캘린더 쓰기 권한 필요
zh_hant: 需要日曆寫入權限

source: 需要相机权限才能扫描二维码
en: Camera access is required to scan QR codes
ja: QRコードをスキャンするにはカメラへのアクセスが必要です
ko: QR 코드 스캔을 위해 카메라 권한이 필요해요
zh_hant: 需要相機權限才能掃描二維碼

source: 需要重启 App
en: Restart Required
ja: 再起動が必要
ko: 재시작 필요
zh_hant: 需要重新啟動 App

source: 项目动态
en: Activity
ja: アクティビティ
ko: 활동
zh_hant: 項目動態

source: 项目名称
en: Project Name
ja: プロジェクト名
ko: 프로젝트 이름
zh_hant: 項目名稱

source: 项目图标
en: Project Icon
ja: プロジェクトアイコン
ko: 프로젝트 아이콘
zh_hant: 項目圖示

source: 项目活动将显示在这里
en: Project activities will appear here
ja: プロジェクトのアクティビティがここに表示されます
ko: 프로젝트 활동이 여기에 표시돼요
zh_hant: 項目活動將顯示在這裡

source: 项目码
en: Project Code
ja: プロジェクトコード
ko: 프로젝트 코드
zh_hant: 項目碼

source: 项目码已复制
en: Project code copied
ja: プロジェクトコードをコピーしました
ko: 프로젝트 코드 복사됨
zh_hant: 項目碼已複製

source: 项目设置
en: Project Settings
ja: プロジェクト設定
ko: 프로젝트 설정
zh_hant: 項目設定

source: 项目邀请
en: Project Invites
ja: プロジェクト招待
ko: 프로젝트 초대
zh_hant: 項目邀請

source: 项目颜色
en: Project Color
ja: プロジェクトカラー
ko: 프로젝트 색상
zh_hant: 項目顏色

source: 预览
en: Preview
ja: プレビュー
ko: 미리보기
zh_hant: 預覽

source: 颜色
en: Color
ja: カラー
ko: 색상
zh_hant: 顏色

source: 首页
en: Home
ja: ホーム
ko: 홈
zh_hant: 首頁

source: 驾车
en: Drive
ja: 車
ko: 자동차
zh_hant: 駕車

source: 高
en: High
ko: 높음

source: 高铁
en: HSR
ja: 高速鉄道
ko: 고속철
zh_hant: 高鐵

source: 高铁 / 火车
en: HSR / Train
ja: 高速鉄道 / 列車
ko: 고속철 / 열차
zh_hant: 高鐵 / 火車

source: 高铁提醒
en: HSR reminders
ja: 高速鉄道リマインダー
ko: 고속철 알림
zh_hant: 高鐵提醒

source: 默认
en: Default
ja: デフォルト
ko: 기본
zh_hant: 預設

source: 默认分类
en: Default Category
ja: デフォルトカテゴリ
ko: 기본 카테고리
zh_hant: 預設分類

source: %@ API Key
ja: %@ APIキー
ko: %@ API 키

source: 1个
ja: 1個
ko: 1개
zh_hant: 1個

source: 3个
ja: 3個
ko: 3개
zh_hant: 3個

source: 5个
ja: 5個
ko: 5개
zh_hant: 5個

source: AviationStack API Key
ja: AviationStack APIキー
ko: AviationStack API 키

source: OK
ko: 확인
